{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define the connection\n",
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://localhost:7687\", user=\"neo4j\", pwd=\"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "# prepare the data\n",
    "# We will be working with the IMDB Top 1000 Dataset from Kaggle: https://www.kaggle.com/datasets/bansodesandeep/imdb-top-1000-movies\n",
    "\n",
    "data = pd.read_csv('imdb_top_1000.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Poster_Link</th>\n",
       "      <th>Series_Title</th>\n",
       "      <th>Released_Year</th>\n",
       "      <th>Certificate</th>\n",
       "      <th>Runtime</th>\n",
       "      <th>Genre</th>\n",
       "      <th>IMDB_Rating</th>\n",
       "      <th>Overview</th>\n",
       "      <th>Meta_score</th>\n",
       "      <th>Director</th>\n",
       "      <th>Star1</th>\n",
       "      <th>Star2</th>\n",
       "      <th>Star3</th>\n",
       "      <th>Star4</th>\n",
       "      <th>No_of_Votes</th>\n",
       "      <th>Gross</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMDFkYT...</td>\n",
       "      <td>The Shawshank Redemption</td>\n",
       "      <td>1994</td>\n",
       "      <td>A</td>\n",
       "      <td>142 min</td>\n",
       "      <td>Drama</td>\n",
       "      <td>9.3</td>\n",
       "      <td>Two imprisoned men bond over a number of years...</td>\n",
       "      <td>80.0</td>\n",
       "      <td>Frank Darabont</td>\n",
       "      <td>Tim Robbins</td>\n",
       "      <td>Morgan Freeman</td>\n",
       "      <td>Bob Gunton</td>\n",
       "      <td>William Sadler</td>\n",
       "      <td>2343110</td>\n",
       "      <td>28,341,469</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BM2MyNj...</td>\n",
       "      <td>The Godfather</td>\n",
       "      <td>1972</td>\n",
       "      <td>A</td>\n",
       "      <td>175 min</td>\n",
       "      <td>Crime, Drama</td>\n",
       "      <td>9.2</td>\n",
       "      <td>An organized crime dynasty's aging patriarch t...</td>\n",
       "      <td>100.0</td>\n",
       "      <td>Francis Ford Coppola</td>\n",
       "      <td>Marlon Brando</td>\n",
       "      <td>Al Pacino</td>\n",
       "      <td>James Caan</td>\n",
       "      <td>Diane Keaton</td>\n",
       "      <td>1620367</td>\n",
       "      <td>134,966,411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMTMxNT...</td>\n",
       "      <td>The Dark Knight</td>\n",
       "      <td>2008</td>\n",
       "      <td>UA</td>\n",
       "      <td>152 min</td>\n",
       "      <td>Action, Crime, Drama</td>\n",
       "      <td>9.0</td>\n",
       "      <td>When the menace known as the Joker wreaks havo...</td>\n",
       "      <td>84.0</td>\n",
       "      <td>Christopher Nolan</td>\n",
       "      <td>Christian Bale</td>\n",
       "      <td>Heath Ledger</td>\n",
       "      <td>Aaron Eckhart</td>\n",
       "      <td>Michael Caine</td>\n",
       "      <td>2303232</td>\n",
       "      <td>534,858,444</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMWMwMG...</td>\n",
       "      <td>The Godfather: Part II</td>\n",
       "      <td>1974</td>\n",
       "      <td>A</td>\n",
       "      <td>202 min</td>\n",
       "      <td>Crime, Drama</td>\n",
       "      <td>9.0</td>\n",
       "      <td>The early life and career of Vito Corleone in ...</td>\n",
       "      <td>90.0</td>\n",
       "      <td>Francis Ford Coppola</td>\n",
       "      <td>Al Pacino</td>\n",
       "      <td>Robert De Niro</td>\n",
       "      <td>Robert Duvall</td>\n",
       "      <td>Diane Keaton</td>\n",
       "      <td>1129952</td>\n",
       "      <td>57,300,000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMWU4N2...</td>\n",
       "      <td>12 Angry Men</td>\n",
       "      <td>1957</td>\n",
       "      <td>U</td>\n",
       "      <td>96 min</td>\n",
       "      <td>Crime, Drama</td>\n",
       "      <td>9.0</td>\n",
       "      <td>A jury holdout attempts to prevent a miscarria...</td>\n",
       "      <td>96.0</td>\n",
       "      <td>Sidney Lumet</td>\n",
       "      <td>Henry Fonda</td>\n",
       "      <td>Lee J. Cobb</td>\n",
       "      <td>Martin Balsam</td>\n",
       "      <td>John Fiedler</td>\n",
       "      <td>689845</td>\n",
       "      <td>4,360,000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>995</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BNGEwMT...</td>\n",
       "      <td>Breakfast at Tiffany's</td>\n",
       "      <td>1961</td>\n",
       "      <td>A</td>\n",
       "      <td>115 min</td>\n",
       "      <td>Comedy, Drama, Romance</td>\n",
       "      <td>7.6</td>\n",
       "      <td>A young New York socialite becomes interested ...</td>\n",
       "      <td>76.0</td>\n",
       "      <td>Blake Edwards</td>\n",
       "      <td>Audrey Hepburn</td>\n",
       "      <td>George Peppard</td>\n",
       "      <td>Patricia Neal</td>\n",
       "      <td>Buddy Ebsen</td>\n",
       "      <td>166544</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>996</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BODk3Yj...</td>\n",
       "      <td>Giant</td>\n",
       "      <td>1956</td>\n",
       "      <td>G</td>\n",
       "      <td>201 min</td>\n",
       "      <td>Drama, Western</td>\n",
       "      <td>7.6</td>\n",
       "      <td>Sprawling epic covering the life of a Texas ca...</td>\n",
       "      <td>84.0</td>\n",
       "      <td>George Stevens</td>\n",
       "      <td>Elizabeth Taylor</td>\n",
       "      <td>Rock Hudson</td>\n",
       "      <td>James Dean</td>\n",
       "      <td>Carroll Baker</td>\n",
       "      <td>34075</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>997</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BM2U3Yz...</td>\n",
       "      <td>From Here to Eternity</td>\n",
       "      <td>1953</td>\n",
       "      <td>Passed</td>\n",
       "      <td>118 min</td>\n",
       "      <td>Drama, Romance, War</td>\n",
       "      <td>7.6</td>\n",
       "      <td>In Hawaii in 1941, a private is cruelly punish...</td>\n",
       "      <td>85.0</td>\n",
       "      <td>Fred Zinnemann</td>\n",
       "      <td>Burt Lancaster</td>\n",
       "      <td>Montgomery Clift</td>\n",
       "      <td>Deborah Kerr</td>\n",
       "      <td>Donna Reed</td>\n",
       "      <td>43374</td>\n",
       "      <td>30,500,000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>998</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BZTBmMj...</td>\n",
       "      <td>Lifeboat</td>\n",
       "      <td>1944</td>\n",
       "      <td>NaN</td>\n",
       "      <td>97 min</td>\n",
       "      <td>Drama, War</td>\n",
       "      <td>7.6</td>\n",
       "      <td>Several survivors of a torpedoed merchant ship...</td>\n",
       "      <td>78.0</td>\n",
       "      <td>Alfred Hitchcock</td>\n",
       "      <td>Tallulah Bankhead</td>\n",
       "      <td>John Hodiak</td>\n",
       "      <td>Walter Slezak</td>\n",
       "      <td>William Bendix</td>\n",
       "      <td>26471</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>999</th>\n",
       "      <td>https://m.media-amazon.com/images/M/MV5BMTY5OD...</td>\n",
       "      <td>The 39 Steps</td>\n",
       "      <td>1935</td>\n",
       "      <td>NaN</td>\n",
       "      <td>86 min</td>\n",
       "      <td>Crime, Mystery, Thriller</td>\n",
       "      <td>7.6</td>\n",
       "      <td>A man in London tries to help a counter-espion...</td>\n",
       "      <td>93.0</td>\n",
       "      <td>Alfred Hitchcock</td>\n",
       "      <td>Robert Donat</td>\n",
       "      <td>Madeleine Carroll</td>\n",
       "      <td>Lucie Mannheim</td>\n",
       "      <td>Godfrey Tearle</td>\n",
       "      <td>51853</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1000 rows × 16 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           Poster_Link  \\\n",
       "0    https://m.media-amazon.com/images/M/MV5BMDFkYT...   \n",
       "1    https://m.media-amazon.com/images/M/MV5BM2MyNj...   \n",
       "2    https://m.media-amazon.com/images/M/MV5BMTMxNT...   \n",
       "3    https://m.media-amazon.com/images/M/MV5BMWMwMG...   \n",
       "4    https://m.media-amazon.com/images/M/MV5BMWU4N2...   \n",
       "..                                                 ...   \n",
       "995  https://m.media-amazon.com/images/M/MV5BNGEwMT...   \n",
       "996  https://m.media-amazon.com/images/M/MV5BODk3Yj...   \n",
       "997  https://m.media-amazon.com/images/M/MV5BM2U3Yz...   \n",
       "998  https://m.media-amazon.com/images/M/MV5BZTBmMj...   \n",
       "999  https://m.media-amazon.com/images/M/MV5BMTY5OD...   \n",
       "\n",
       "                 Series_Title Released_Year Certificate  Runtime  \\\n",
       "0    The Shawshank Redemption          1994           A  142 min   \n",
       "1               The Godfather          1972           A  175 min   \n",
       "2             The Dark Knight          2008          UA  152 min   \n",
       "3      The Godfather: Part II          1974           A  202 min   \n",
       "4                12 Angry Men          1957           U   96 min   \n",
       "..                        ...           ...         ...      ...   \n",
       "995    Breakfast at Tiffany's          1961           A  115 min   \n",
       "996                     Giant          1956           G  201 min   \n",
       "997     From Here to Eternity          1953      Passed  118 min   \n",
       "998                  Lifeboat          1944         NaN   97 min   \n",
       "999              The 39 Steps          1935         NaN   86 min   \n",
       "\n",
       "                        Genre  IMDB_Rating  \\\n",
       "0                       Drama          9.3   \n",
       "1                Crime, Drama          9.2   \n",
       "2        Action, Crime, Drama          9.0   \n",
       "3                Crime, Drama          9.0   \n",
       "4                Crime, Drama          9.0   \n",
       "..                        ...          ...   \n",
       "995    Comedy, Drama, Romance          7.6   \n",
       "996            Drama, Western          7.6   \n",
       "997       Drama, Romance, War          7.6   \n",
       "998                Drama, War          7.6   \n",
       "999  Crime, Mystery, Thriller          7.6   \n",
       "\n",
       "                                              Overview  Meta_score  \\\n",
       "0    Two imprisoned men bond over a number of years...        80.0   \n",
       "1    An organized crime dynasty's aging patriarch t...       100.0   \n",
       "2    When the menace known as the Joker wreaks havo...        84.0   \n",
       "3    The early life and career of Vito Corleone in ...        90.0   \n",
       "4    A jury holdout attempts to prevent a miscarria...        96.0   \n",
       "..                                                 ...         ...   \n",
       "995  A young New York socialite becomes interested ...        76.0   \n",
       "996  Sprawling epic covering the life of a Texas ca...        84.0   \n",
       "997  In Hawaii in 1941, a private is cruelly punish...        85.0   \n",
       "998  Several survivors of a torpedoed merchant ship...        78.0   \n",
       "999  A man in London tries to help a counter-espion...        93.0   \n",
       "\n",
       "                 Director              Star1              Star2  \\\n",
       "0          Frank Darabont        Tim Robbins     Morgan Freeman   \n",
       "1    Francis Ford Coppola      Marlon Brando          Al Pacino   \n",
       "2       Christopher Nolan     Christian Bale       Heath Ledger   \n",
       "3    Francis Ford Coppola          Al Pacino     Robert De Niro   \n",
       "4            Sidney Lumet        Henry Fonda        Lee J. Cobb   \n",
       "..                    ...                ...                ...   \n",
       "995         Blake Edwards     Audrey Hepburn     George Peppard   \n",
       "996        George Stevens   Elizabeth Taylor        Rock Hudson   \n",
       "997        Fred Zinnemann     Burt Lancaster   Montgomery Clift   \n",
       "998      Alfred Hitchcock  Tallulah Bankhead        John Hodiak   \n",
       "999      Alfred Hitchcock       Robert Donat  Madeleine Carroll   \n",
       "\n",
       "              Star3           Star4  No_of_Votes        Gross  \n",
       "0        Bob Gunton  William Sadler      2343110   28,341,469  \n",
       "1        James Caan    Diane Keaton      1620367  134,966,411  \n",
       "2     Aaron Eckhart   Michael Caine      2303232  534,858,444  \n",
       "3     Robert Duvall    Diane Keaton      1129952   57,300,000  \n",
       "4     Martin Balsam    John Fiedler       689845    4,360,000  \n",
       "..              ...             ...          ...          ...  \n",
       "995   Patricia Neal     Buddy Ebsen       166544          NaN  \n",
       "996      James Dean   Carroll Baker        34075          NaN  \n",
       "997    Deborah Kerr      Donna Reed        43374   30,500,000  \n",
       "998   Walter Slezak  William Bendix        26471          NaN  \n",
       "999  Lucie Mannheim  Godfrey Tearle        51853          NaN  \n",
       "\n",
       "[1000 rows x 16 columns]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create a list of unique person names and then create a node for each person\n",
    "\n",
    "directors = data.Director.to_list()\n",
    "star1 = data.Star1.to_list()\n",
    "star2 = data.Star2.to_list()\n",
    "star3 = data.Star3.to_list()\n",
    "star4 = data.Star4.to_list()\n",
    "\n",
    "person_unique = []\n",
    "\n",
    "for person in (directors + star1 + star2 + star3 + star3):\n",
    "    if person not in person_unique:\n",
    "        person_unique.append(person.replace(\"'\",\"\"))\n",
    "\n",
    "for person in person_unique:\n",
    "    conn.query('CREATE (p:Person{{name:{0}}})'.format(repr(person)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Frank Darabont',\n",
       " 'Francis Ford Coppola',\n",
       " 'Christopher Nolan',\n",
       " 'Sidney Lumet',\n",
       " 'Peter Jackson',\n",
       " 'Quentin Tarantino',\n",
       " 'Steven Spielberg',\n",
       " 'David Fincher',\n",
       " 'Robert Zemeckis',\n",
       " 'Sergio Leone',\n",
       " 'Lana Wachowski',\n",
       " 'Martin Scorsese',\n",
       " 'Irvin Kershner',\n",
       " 'Milos Forman',\n",
       " 'Thomas Kail',\n",
       " 'Bong Joon Ho',\n",
       " 'Sudha Kongara',\n",
       " 'Fernando Meirelles',\n",
       " 'Hayao Miyazaki',\n",
       " 'Roberto Benigni',\n",
       " 'Jonathan Demme',\n",
       " 'George Lucas',\n",
       " 'Masaki Kobayashi',\n",
       " 'Akira Kurosawa',\n",
       " 'Frank Capra',\n",
       " 'Todd Phillips',\n",
       " 'Damien Chazelle',\n",
       " 'Olivier Nakache',\n",
       " 'Roman Polanski',\n",
       " 'Ridley Scott',\n",
       " 'Tony Kaye',\n",
       " 'Bryan Singer',\n",
       " 'Luc Besson',\n",
       " 'Roger Allers',\n",
       " 'James Cameron',\n",
       " 'Giuseppe Tornatore',\n",
       " 'Isao Takahata',\n",
       " 'Alfred Hitchcock',\n",
       " 'Michael Curtiz',\n",
       " 'Charles Chaplin',\n",
       " 'Nadine Labaki',\n",
       " 'Can Ulkay',\n",
       " 'Gayatri',\n",
       " 'Makoto Shinkai',\n",
       " 'Nitesh Tiwari',\n",
       " 'Bob Persichetti',\n",
       " 'Anthony Russo',\n",
       " 'Lee Unkrich',\n",
       " 'Rajkumar Hirani',\n",
       " 'Aamir Khan',\n",
       " 'Andrew Stanton',\n",
       " 'Florian Henckel von Donnersmarck',\n",
       " 'Chan-wook Park',\n",
       " 'Stanley Kubrick',\n",
       " 'Hrishikesh Mukherjee',\n",
       " 'Billy Wilder',\n",
       " 'Sam Mendes',\n",
       " 'Rahi Anil Barve',\n",
       " 'Sriram Raghavan',\n",
       " 'Jeethu Joseph',\n",
       " 'Thomas Vinterberg',\n",
       " 'Asghar Farhadi',\n",
       " 'Denis Villeneuve',\n",
       " 'Mehmet Ada Öztekin',\n",
       " 'Çagan Irmak',\n",
       " 'Michel Gondry',\n",
       " 'Jean-Pierre Jeunet',\n",
       " 'Guy Ritchie',\n",
       " 'Darren Aronofsky',\n",
       " 'Gus Van Sant',\n",
       " 'Majid Majidi',\n",
       " 'John Lasseter',\n",
       " 'Mel Gibson',\n",
       " 'Elem Klimov',\n",
       " 'Brian De Palma',\n",
       " 'Richard Marquand',\n",
       " 'Wolfgang Petersen',\n",
       " 'George Roy Hill',\n",
       " 'David Lean',\n",
       " 'Stanley Donen',\n",
       " 'Vittorio De Sica',\n",
       " 'Orson Welles',\n",
       " 'Fritz Lang',\n",
       " 'Aditya Dhar',\n",
       " 'Prashanth Neel',\n",
       " 'Peter Farrelly',\n",
       " 'Martin McDonagh',\n",
       " 'Meghna Gulzar',\n",
       " 'S.S. Rajamouli',\n",
       " 'Sergio Pablos',\n",
       " 'Nishikant Kamat',\n",
       " 'Vikas Bahl',\n",
       " 'Zaza Urushadze',\n",
       " 'Rakeysh Omprakash Mehra',\n",
       " 'Anurag Kashyap',\n",
       " 'Vikramaditya Motwane',\n",
       " 'Tigmanshu Dhulia',\n",
       " 'Juan José Campanella',\n",
       " 'Gavin OConnor',\n",
       " 'Pete Docter',\n",
       " 'Shimit Amin',\n",
       " 'Paul Thomas Anderson',\n",
       " 'Guillermo del Toro',\n",
       " 'James McTeigue',\n",
       " 'Sanjay Leela Bhansali',\n",
       " 'Ashutosh Gowariker',\n",
       " 'Oliver Hirschbiegel',\n",
       " 'Ron Howard',\n",
       " 'Priyadarshan',\n",
       " 'Curtis Hanson',\n",
       " 'Yavuz Turgul',\n",
       " 'Michael Mann',\n",
       " 'Rajkumar Santoshi',\n",
       " 'Clint Eastwood',\n",
       " 'Emir Kusturica',\n",
       " 'John McTiernan',\n",
       " 'Andrei Tarkovsky',\n",
       " 'Ingmar Bergman',\n",
       " 'Moustapha Akkad',\n",
       " 'Ramesh Sippy',\n",
       " 'Terry Gilliam',\n",
       " 'John Sturges',\n",
       " 'Robert Mulligan',\n",
       " 'Stanley Kramer',\n",
       " 'Jules Dassin',\n",
       " 'Yasujirô Ozu',\n",
       " 'Joseph L. Mankiewicz',\n",
       " 'John Huston',\n",
       " 'Ernst Lubitsch',\n",
       " 'Buster Keaton',\n",
       " 'Céline Sciamma',\n",
       " 'Aniruddha Roy Chowdhury',\n",
       " 'Naoko Yamada',\n",
       " 'Oriol Paulo',\n",
       " 'Xavier Dolan',\n",
       " 'Vishal Bhardwaj',\n",
       " 'James Mangold',\n",
       " 'Lenny Abrahamson',\n",
       " 'Damián Szifron',\n",
       " 'Nuri Bilge Ceylan',\n",
       " 'Umesh Shukla',\n",
       " 'Wes Anderson',\n",
       " 'Mamoru Hosoda',\n",
       " 'Anurag Basu',\n",
       " 'Steve McQueen',\n",
       " 'Tom McCarthy',\n",
       " 'Tomm Moore',\n",
       " 'Sujoy Ghosh',\n",
       " 'Zoya Akhtar',\n",
       " 'George Miller',\n",
       " 'Neeraj Pandey',\n",
       " 'David Yates',\n",
       " 'Yôjirô Takita',\n",
       " 'Lasse Hallström',\n",
       " 'Adam Elliot',\n",
       " 'Dean DeBlois',\n",
       " 'Sean Penn',\n",
       " 'Ethan Coen',\n",
       " 'Terry George',\n",
       " 'Je-kyu Kang',\n",
       " 'Richard Linklater',\n",
       " 'Farhan Akhtar',\n",
       " 'Alejandro G. Iñárritu',\n",
       " 'Hideaki Anno',\n",
       " 'M. Night Shyamalan',\n",
       " 'Peter Weir',\n",
       " 'Joel Coen',\n",
       " 'Kar-Wai Wong',\n",
       " 'Danny Boyle',\n",
       " 'Mathieu Kassovitz',\n",
       " 'Aditya Chopra',\n",
       " 'Krzysztof Kieslowski',\n",
       " 'Jim Sheridan',\n",
       " 'Kaige Chen',\n",
       " 'Yimou Zhang',\n",
       " 'Rob Reiner',\n",
       " 'Oliver Stone',\n",
       " 'Wim Wenders',\n",
       " 'John Carpenter',\n",
       " 'Alan Parker',\n",
       " 'Werner Herzog',\n",
       " 'David Lynch',\n",
       " 'Terry Jones',\n",
       " 'Michael Cimino',\n",
       " 'John G. Avildsen',\n",
       " 'Peter Bogdanovich',\n",
       " 'Jean-Pierre Melville',\n",
       " 'Stuart Rosenberg',\n",
       " 'Gillo Pontecorvo',\n",
       " 'Luis Buñuel',\n",
       " 'Robert Aldrich',\n",
       " 'John Ford',\n",
       " 'François Truffaut',\n",
       " 'William Wyler',\n",
       " 'Federico Fellini',\n",
       " 'Elia Kazan',\n",
       " 'Henri-Georges Clouzot',\n",
       " 'Raoul Walsh',\n",
       " 'Carol Reed',\n",
       " 'Michael Powell',\n",
       " 'Victor Fleming',\n",
       " 'Jean Renoir',\n",
       " 'Carl Theodor Dreyer',\n",
       " 'F.W. Murnau',\n",
       " 'Clyde Bruckman',\n",
       " 'Robert Wiene',\n",
       " 'Amit Ravindernath Sharma',\n",
       " 'Ericson Core',\n",
       " 'Raja Menon',\n",
       " 'Kabir Khan',\n",
       " 'Garth Davis',\n",
       " 'Byron Howard',\n",
       " 'Stephen Chbosky',\n",
       " 'Destin Daniel Cretton',\n",
       " 'Gareth Evans',\n",
       " 'Morten Tyldum',\n",
       " 'James Gunn',\n",
       " 'Spike Jonze',\n",
       " 'José Padilha',\n",
       " 'Tom Hooper',\n",
       " 'Tate Taylor',\n",
       " 'Tim Miller',\n",
       " 'Wilson Yip',\n",
       " 'Karan Johar',\n",
       " 'Levent Semerci',\n",
       " 'Joss Whedon',\n",
       " 'Vincent Paronnaud',\n",
       " 'Jean-Marc Vallée',\n",
       " 'Gabriele Muccino',\n",
       " 'Edward Zwick',\n",
       " 'Paul Greengrass',\n",
       " 'Ki-duk Kim',\n",
       " 'Frank Miller',\n",
       " 'Julian Schnabel',\n",
       " 'Ömer Faruk Sorak',\n",
       " 'Brad Bird',\n",
       " 'Martin Campbell',\n",
       " 'Andrey Zvyagintsev',\n",
       " 'Alejandro Amenábar',\n",
       " 'Nikkhil Advani',\n",
       " 'Andrew Lau',\n",
       " 'Gore Verbinski',\n",
       " 'Tim Burton',\n",
       " 'Jae-young Kwak',\n",
       " 'Lars von Trier',\n",
       " 'Yilmaz Erdogan',\n",
       " 'Richard Kelly',\n",
       " 'Satoshi Kon',\n",
       " 'Walter Salles',\n",
       " 'Thomas Jahn',\n",
       " 'Billy Bob Thornton',\n",
       " 'Mike Leigh',\n",
       " 'Mamoru Oshii',\n",
       " 'Henry Selick',\n",
       " 'Harold Ramis',\n",
       " 'Taylor Hackford',\n",
       " 'Martin Brest',\n",
       " 'Ron Clements',\n",
       " 'Gary Trousdale',\n",
       " 'Kevin Costner',\n",
       " 'Spike Lee',\n",
       " 'Barry Levinson',\n",
       " 'Katsuhiro Ôtomo',\n",
       " 'Louis Malle',\n",
       " 'Richard Attenborough',\n",
       " 'Hal Ashby',\n",
       " 'Woody Allen',\n",
       " 'Mel Brooks',\n",
       " 'Franklin J. Schaffner',\n",
       " 'William Friedkin',\n",
       " 'Norman Jewison',\n",
       " 'Bernardo Bertolucci',\n",
       " 'Mike Nichols',\n",
       " 'Robert Wise',\n",
       " 'Jean-Luc Godard',\n",
       " 'Robert Rossen',\n",
       " 'Howard Hawks',\n",
       " 'Otto Preminger',\n",
       " 'Richard Brooks',\n",
       " 'Alexander Mackendrick',\n",
       " 'Charles Laughton',\n",
       " 'Nicholas Ray',\n",
       " 'Robert Hamer',\n",
       " 'Jacques Tourneur',\n",
       " 'W.S. Van Dyke',\n",
       " 'Lewis Milestone',\n",
       " 'Sergei M. Eisenstein',\n",
       " 'Rian Johnson',\n",
       " 'Mukesh Chhabra',\n",
       " 'Hirokazu Koreeda',\n",
       " 'Noah Baumbach',\n",
       " 'Luca Guadagnino',\n",
       " 'Ken Loach',\n",
       " 'Taika Waititi',\n",
       " 'Matt Ross',\n",
       " 'John Carney',\n",
       " 'Dan Gilroy',\n",
       " 'J.J. Abrams',\n",
       " 'Michel Hazanavicius',\n",
       " 'Doug Liman',\n",
       " 'Michael Haneke',\n",
       " 'Jacques Audiard',\n",
       " 'Duncan Jones',\n",
       " 'Tomas Alfredson',\n",
       " 'Neill Blomkamp',\n",
       " 'Imtiaz Ali',\n",
       " 'Cristian Mungiu',\n",
       " 'Richard Schenkman',\n",
       " 'Tarsem Singh',\n",
       " 'Ang Lee',\n",
       " 'Christophe Barratier',\n",
       " 'Jon Favreau',\n",
       " 'Edgar Wright',\n",
       " 'Fatih Akin',\n",
       " 'Alfonso Cuarón',\n",
       " 'Pedro Almodóvar',\n",
       " 'Danis Tanovic',\n",
       " 'Shinichirô Watanabe',\n",
       " 'Fabián Bielinsky',\n",
       " 'Cameron Crowe',\n",
       " 'Yoshifumi Kondô',\n",
       " 'Lee Tamahori',\n",
       " 'Tony Scott',\n",
       " 'Yoshiaki Kawajiri',\n",
       " 'Bob Clark',\n",
       " 'John Landis',\n",
       " 'Bob Fosse',\n",
       " 'George A. Romero',\n",
       " 'Alan J. Pakula',\n",
       " 'Alejandro Jodorowsky',\n",
       " 'Sam Peckinpah',\n",
       " 'Anthony Harvey',\n",
       " 'John Frankenheimer',\n",
       " 'Michelangelo Antonioni',\n",
       " 'Alain Resnais',\n",
       " 'Cecil B. DeMille',\n",
       " 'Fred Zinnemann',\n",
       " 'Henry Koster',\n",
       " 'George Seaton',\n",
       " 'George Cukor',\n",
       " 'Sam Wood',\n",
       " 'Merian C. Cooper',\n",
       " 'Tod Browning',\n",
       " 'Darius Marder',\n",
       " 'Paolo Genovese',\n",
       " 'Theodore Melfi',\n",
       " 'Paul King',\n",
       " 'Abhishek Chaubey',\n",
       " 'Travis Knight',\n",
       " 'Kenneth Lonergan',\n",
       " 'Martin Zandvliet',\n",
       " 'Gareth Edwards',\n",
       " 'Greta Gerwig',\n",
       " 'Dorota Kobiela',\n",
       " 'Matthew Warchus',\n",
       " 'Paolo Sorrentino',\n",
       " 'Ritesh Batra',\n",
       " 'Shoojit Sircar',\n",
       " 'Don Hall',\n",
       " 'Richard Curtis',\n",
       " 'Gauri Shinde',\n",
       " 'Josh Cooley',\n",
       " 'Adam McKay',\n",
       " 'Tetsuya Nakashima',\n",
       " 'Jee-woon Kim',\n",
       " 'Jeong-beom Lee',\n",
       " 'F. Gary Gray',\n",
       " 'Hong-jin Na',\n",
       " 'Niels Arden Oplev',\n",
       " 'Aaron Sorkin',\n",
       " 'David O. Russell',\n",
       " 'Pierre Morel',\n",
       " 'Mark Herman',\n",
       " 'Joe Wright',\n",
       " 'Nicolas Winding Refn',\n",
       " 'Jaco Van Dormael',\n",
       " 'Jonathan Dayton',\n",
       " 'Yash Chopra',\n",
       " 'Anders Thomas Jensen',\n",
       " 'Roger Donaldson',\n",
       " 'Mikael Håfström',\n",
       " 'Nick Cassavetes',\n",
       " 'Lukas Moodysson',\n",
       " 'Sylvain Chomet',\n",
       " 'Kevin Reynolds',\n",
       " 'Boaz Yakin',\n",
       " 'Troy Duffy',\n",
       " 'Joe Johnston',\n",
       " 'Andrew Adamson',\n",
       " 'Takeshi Kitano',\n",
       " 'Andrew Niccol',\n",
       " 'George P. Cosmatos',\n",
       " 'David Mickey Evans',\n",
       " 'James Ivory',\n",
       " 'Andrew Davis',\n",
       " 'Robert De Niro',\n",
       " 'Kevin Altieri',\n",
       " 'John Woo',\n",
       " 'Jim Jarmusch',\n",
       " 'John Singleton',\n",
       " 'Penny Marshall',\n",
       " 'Sam Raimi',\n",
       " 'John Hughes',\n",
       " 'Richard Donner',\n",
       " 'Roland Joffé',\n",
       " 'Ivan Reitman',\n",
       " 'Philip Kaufman',\n",
       " 'Robert Benton',\n",
       " 'Terrence Malick',\n",
       " 'René Laloux',\n",
       " 'Mel Stuart',\n",
       " 'John Schlesinger',\n",
       " 'Terence Young',\n",
       " 'Arthur Penn',\n",
       " 'Robert Stevenson',\n",
       " 'Ken Annakin',\n",
       " 'Jack Clayton',\n",
       " 'James Whale',\n",
       " 'Leo McCarey',\n",
       " 'Francis Lee',\n",
       " 'David Leitch',\n",
       " 'Taylor Sheridan',\n",
       " 'Jordan Peele',\n",
       " 'Christopher McQuarrie',\n",
       " 'Hannes Holm',\n",
       " 'Jemaine Clement',\n",
       " 'James Simone',\n",
       " 'James Marsh',\n",
       " 'Matthew Vaughn',\n",
       " 'Josh Boone',\n",
       " 'Alfonso Gomez-Rejon',\n",
       " 'Abdellatif Kechiche',\n",
       " 'Abhishek Kapoor',\n",
       " 'Felix van Groeningen',\n",
       " 'Alexander Payne',\n",
       " 'Rich Moore',\n",
       " 'Mark Osborne',\n",
       " 'Christopher Miller',\n",
       " 'Cary Joji Fukunaga',\n",
       " 'Ben Affleck',\n",
       " 'Marc Webb',\n",
       " 'Shûsuke Kaneko',\n",
       " 'Shane Meadows',\n",
       " 'Alex Garland',\n",
       " 'Susanne Bier',\n",
       " 'Kevin Macdonald',\n",
       " 'Paul McGuigan',\n",
       " 'Christian Carion',\n",
       " 'Anton Corbijn',\n",
       " 'Nathan Greno',\n",
       " 'Paul Verhoeven',\n",
       " 'Paul Haggis',\n",
       " 'Stephen Chow',\n",
       " 'Brad Anderson',\n",
       " 'Sofia Coppola',\n",
       " 'Mike Newell',\n",
       " 'Peter Mullan',\n",
       " 'Wolfgang Becker',\n",
       " 'Jessie Nelson',\n",
       " 'Stephen Daldry',\n",
       " 'John Cameron Mitchell',\n",
       " 'Steven Soderbergh',\n",
       " 'Bob Gale',\n",
       " 'Trey Parker',\n",
       " 'Mike Judge',\n",
       " 'Todd Solondz',\n",
       " 'Antoine Fuqua',\n",
       " 'James L. Brooks',\n",
       " 'Francis Veber',\n",
       " 'Scott Hicks',\n",
       " 'Gregory Hoblit',\n",
       " 'Kenneth Branagh',\n",
       " 'Michael Radford',\n",
       " 'Kevin Smith',\n",
       " 'Robert Altman',\n",
       " 'Brian Henson',\n",
       " 'James Foley',\n",
       " 'Jon Avnet',\n",
       " 'George Sluizer',\n",
       " 'Bruce Robinson',\n",
       " 'Jean-Jacques Annaud',\n",
       " 'Nicholas Meyer',\n",
       " 'Ted Kotcheff',\n",
       " 'Robert Redford',\n",
       " 'Jim Abrahams',\n",
       " 'Joseph Sargent',\n",
       " 'Robert Clouse',\n",
       " 'John Boorman',\n",
       " 'Don Siegel',\n",
       " 'Brian G. Hutton',\n",
       " 'Gene Saks',\n",
       " 'Cy Endfield',\n",
       " 'Guy Hamilton',\n",
       " 'J. Lee Thompson',\n",
       " 'Georges Franju',\n",
       " 'Charles Vidor',\n",
       " 'James Algar',\n",
       " 'Todd Haynes',\n",
       " 'Aneesh Chaganty',\n",
       " 'Sean Baker',\n",
       " 'Tyler Nilson',\n",
       " 'Sebastian Schipper',\n",
       " 'Deniz Gamze Ergüven',\n",
       " 'Joseph Kosinski',\n",
       " 'Ryan Coogler',\n",
       " 'David Mackenzie',\n",
       " 'Stephen Frears',\n",
       " 'Matt Reeves',\n",
       " 'David Ayer',\n",
       " 'Hiromasa Yonebayashi',\n",
       " 'Bradley Cooper',\n",
       " 'Pierre Coffin',\n",
       " 'Jonathan Levine',\n",
       " 'Daniel Monzón',\n",
       " 'Bennett Miller',\n",
       " 'Ruben Fleischer',\n",
       " 'Dennis Gansel',\n",
       " 'John Lee Hancock',\n",
       " 'David Cronenberg',\n",
       " 'Olivier Dahan',\n",
       " 'Ronny Yu',\n",
       " 'Neil Burger',\n",
       " 'Zack Snyder',\n",
       " 'James Wan',\n",
       " 'Charlie Kaufman',\n",
       " 'Gregg Araki',\n",
       " 'Yann Samuell',\n",
       " 'Marc Forster',\n",
       " 'Eric Bress',\n",
       " 'Kinji Fukasaku',\n",
       " 'Chris Columbus',\n",
       " 'Ted Demme',\n",
       " 'Mary Harron',\n",
       " 'Tom Tykwer',\n",
       " 'Tony Bancroft',\n",
       " 'Alex Proyas',\n",
       " 'Joel Schumacher',\n",
       " 'Jonathan Lynn',\n",
       " 'Marc Caro',\n",
       " 'David Zucker',\n",
       " 'Mark Rydell',\n",
       " 'Walter Hill',\n",
       " 'James Frawley',\n",
       " 'Martin Rosen',\n",
       " 'Wolfgang Reitherman',\n",
       " 'Richard Lester',\n",
       " 'Blake Edwards',\n",
       " 'George Stevens',\n",
       " 'Tim Robbins',\n",
       " 'Marlon Brando',\n",
       " 'Christian Bale',\n",
       " 'Al Pacino',\n",
       " 'Henry Fonda',\n",
       " 'Elijah Wood',\n",
       " 'John Travolta',\n",
       " 'Liam Neeson',\n",
       " 'Leonardo DiCaprio',\n",
       " 'Brad Pitt',\n",
       " 'Tom Hanks',\n",
       " 'Lilly Wachowski',\n",
       " 'Mark Hamill',\n",
       " 'Jack Nicholson',\n",
       " 'Lin-Manuel Miranda',\n",
       " 'Kang-ho Song',\n",
       " 'Suriya',\n",
       " 'Matthew McConaughey',\n",
       " 'Kátia Lund',\n",
       " 'Daveigh Chase',\n",
       " 'Morgan Freeman',\n",
       " 'Jodie Foster',\n",
       " 'Tatsuya Nakadai',\n",
       " 'Toshirô Mifune',\n",
       " 'James Stewart',\n",
       " 'Joaquin Phoenix',\n",
       " 'Miles Teller',\n",
       " 'Éric Toledano',\n",
       " 'Adrien Brody',\n",
       " 'Russell Crowe',\n",
       " 'Edward Norton',\n",
       " 'Kevin Spacey',\n",
       " 'Jean Reno',\n",
       " 'Rob Minkoff',\n",
       " 'Arnold Schwarzenegger',\n",
       " 'Philippe Noiret',\n",
       " 'Tsutomu Tatsumi',\n",
       " 'Michael J. Fox',\n",
       " 'Anthony Perkins',\n",
       " 'Humphrey Bogart',\n",
       " 'Zain Al Rafeea',\n",
       " 'Erdem Can',\n",
       " 'Pushkar',\n",
       " 'Ryûnosuke Kamiki',\n",
       " 'Peter Ramsey',\n",
       " 'Joe Russo',\n",
       " 'Adrian Molina',\n",
       " 'Jamie Foxx',\n",
       " 'Amole Gupte',\n",
       " 'Ben Burtt',\n",
       " 'Ulrich Mühe',\n",
       " 'Choi Min-sik',\n",
       " 'Guy Pearce',\n",
       " 'Yôji Matsuda',\n",
       " 'Harrison Ford',\n",
       " 'Martin Sheen',\n",
       " 'Sigourney Weaver',\n",
       " 'Rajesh Khanna',\n",
       " 'Peter Sellers',\n",
       " 'Tyrone Power',\n",
       " 'Kirk Douglas',\n",
       " 'William Holden',\n",
       " 'Dean-Charles Chapman',\n",
       " 'Anand Gandhi',\n",
       " 'Ayushmann Khurrana',\n",
       " 'Mohanlal',\n",
       " 'Mads Mikkelsen',\n",
       " 'Payman Maadi',\n",
       " 'Lubna Azabal',\n",
       " 'Aras Bulut Iynemli',\n",
       " 'Çetin Tekindor',\n",
       " 'Jim Carrey',\n",
       " 'Audrey Tautou',\n",
       " 'Jason Statham',\n",
       " 'Ellen Burstyn',\n",
       " 'Robin Williams',\n",
       " 'Mohammad Amir Naji',\n",
       " 'Harvey Keitel',\n",
       " 'Matthew Modine',\n",
       " 'Aleksey Kravchenko',\n",
       " 'F. Murray Abraham',\n",
       " 'Jürgen Prochnow',\n",
       " 'Paul Newman',\n",
       " 'Malcolm McDowell',\n",
       " 'Keir Dullea',\n",
       " 'Peter OToole',\n",
       " 'Jack Lemmon',\n",
       " 'Cary Grant',\n",
       " 'Gene Kelly',\n",
       " 'Takashi Shimura',\n",
       " 'Lamberto Maggiorani',\n",
       " 'Fred MacMurray',\n",
       " 'Peter Lorre',\n",
       " 'Brigitte Helm',\n",
       " 'Sushant Singh Rajput',\n",
       " 'Vicky Kaushal',\n",
       " 'Yash',\n",
       " 'Viggo Mortensen',\n",
       " 'Frances McDormand',\n",
       " 'Irrfan Khan',\n",
       " 'Prabhas',\n",
       " 'Carlos Martínez López',\n",
       " 'Ajay Devgn',\n",
       " 'Kangana Ranaut',\n",
       " 'Lembit Ulfsak',\n",
       " 'Manoj Bajpayee',\n",
       " 'Rajat Barmecha',\n",
       " 'Ricardo Darín',\n",
       " 'Tom Hardy',\n",
       " 'Bob Peterson',\n",
       " 'Shah Rukh Khan',\n",
       " 'Daniel Day-Lewis',\n",
       " 'Ivana Baquero',\n",
       " 'Hugo Weaving',\n",
       " 'Amitabh Bachchan',\n",
       " 'Bruno Ganz',\n",
       " 'Chieko Baishô',\n",
       " 'Akshay Kumar',\n",
       " 'Jason Flemyng',\n",
       " 'Sener Sen',\n",
       " 'Davor Dujmovic',\n",
       " 'Hitoshi Takagi',\n",
       " 'Bruce Willis',\n",
       " 'Alisa Freyndlikh',\n",
       " 'Ingrid Bergman',\n",
       " 'Anthony Quinn',\n",
       " 'Sanjeev Kumar',\n",
       " 'Gregory Peck',\n",
       " 'Spencer Tracy',\n",
       " 'Marilyn Monroe',\n",
       " 'Victor Sjöström',\n",
       " 'Max von Sydow',\n",
       " 'Jean Servais',\n",
       " 'Ray Milland',\n",
       " 'Chishû Ryû',\n",
       " 'Bette Davis',\n",
       " 'Carole Lombard',\n",
       " 'Noémie Merlant',\n",
       " 'Taapsee Pannu',\n",
       " 'Miyu Irino',\n",
       " 'Mario Casas',\n",
       " 'Kim Min-hee',\n",
       " 'Anne Dorval',\n",
       " 'Shahid Kapoor',\n",
       " 'Hugh Jackman',\n",
       " 'Brie Larson',\n",
       " 'Darío Grandinetti',\n",
       " 'Kemp Powers',\n",
       " 'Haluk Bilginer',\n",
       " 'Paresh Rawal',\n",
       " 'Ralph Fiennes',\n",
       " 'Aoi Miyazaki',\n",
       " 'Andrew Garfield',\n",
       " 'Ronnie Del Carmen',\n",
       " 'Ranbir Kapoor',\n",
       " 'Chiwetel Ejiofor',\n",
       " 'Daniel Brühl',\n",
       " 'Matt Damon',\n",
       " 'Mark Ruffalo',\n",
       " 'David Rawle',\n",
       " 'Vidya Balan',\n",
       " 'Hrithik Roshan',\n",
       " 'Anupam Kher',\n",
       " 'Daniel Radcliffe',\n",
       " 'Masahiro Motoki',\n",
       " 'Richard Gere',\n",
       " 'Toni Collette',\n",
       " 'Chris Sanders',\n",
       " 'Emile Hirsch',\n",
       " 'Sanjay Dutt',\n",
       " 'Hilary Swank',\n",
       " 'Don Cheadle',\n",
       " 'Jang Dong-Gun',\n",
       " 'Ethan Hawke',\n",
       " 'Uma Thurman',\n",
       " 'Emilio Echevarría',\n",
       " 'David Silverman',\n",
       " 'Kazuya Tsurumaki',\n",
       " 'Tim Roth',\n",
       " 'Bajram Severdzan',\n",
       " 'Tony Chiu-Wai Leung',\n",
       " 'Ewan McGregor',\n",
       " 'Predrag Miki Manojlovic',\n",
       " 'Vincent Cassel',\n",
       " 'Irène Jacob',\n",
       " 'Brigitte Lin',\n",
       " 'Sam Neill',\n",
       " 'Leslie Cheung',\n",
       " 'Gong Li',\n",
       " 'Wil Wheaton',\n",
       " 'Charlie Sheen',\n",
       " 'Harry Dean Stanton',\n",
       " 'Sumi Shimamoto',\n",
       " 'Kurt Russell',\n",
       " 'Bob Geldof',\n",
       " 'Klaus Kinski',\n",
       " 'Bertil Guve',\n",
       " 'Anthony Hopkins',\n",
       " 'Graham Chapman',\n",
       " 'Sylvester Stallone',\n",
       " 'Faye Dunaway',\n",
       " 'Ryan ONeal',\n",
       " 'Margarita Terekhova',\n",
       " 'Ryan ONeal',\n",
       " 'Harriet Andersson',\n",
       " 'Natalya Bondarchuk',\n",
       " 'Alain Delon',\n",
       " 'Bibi Andersson',\n",
       " 'Anatoliy Solonitsyn',\n",
       " 'Brahim Hadjadj',\n",
       " 'Silvia Pinal',\n",
       " 'Eduard Abalov',\n",
       " 'Jean-Pierre Léaud',\n",
       " 'Charlton Heston',\n",
       " 'Giulietta Masina',\n",
       " 'Yves Montand',\n",
       " 'James Cagney',\n",
       " 'Emeric Pressburger',\n",
       " 'Margaret Sullavan',\n",
       " 'Laurence Olivier',\n",
       " 'Jean Gabin',\n",
       " 'Clark Gable',\n",
       " 'Maria Falconetti',\n",
       " 'George OBrien',\n",
       " 'Werner Krauss',\n",
       " 'Willem Dafoe',\n",
       " 'Salman Khan',\n",
       " 'Ryan Gosling',\n",
       " 'Dev Patel',\n",
       " 'Chloë Grace Moretz',\n",
       " 'Jacob Tremblay',\n",
       " 'Vijay Varma',\n",
       " 'Iko Uwais',\n",
       " 'Benedict Cumberbatch',\n",
       " 'Chris Pratt',\n",
       " 'Rami Malek',\n",
       " 'Logan Lerman',\n",
       " 'Wagner Moura',\n",
       " 'Colin Firth',\n",
       " 'Emma Stone',\n",
       " 'Ryan Reynolds',\n",
       " 'Golshifteh Farahani',\n",
       " 'Abhay Deol',\n",
       " 'Donnie Yen',\n",
       " 'Loveleen Tandan',\n",
       " 'Natalie Portman',\n",
       " 'Robert Downey Jr.',\n",
       " 'Marjane Satrapi',\n",
       " 'Will Smith',\n",
       " 'Seung-Yun Lee',\n",
       " 'Laura Obiols',\n",
       " 'Cem Yilmaz',\n",
       " 'Jan Pinkava',\n",
       " 'Daniel Craig',\n",
       " 'Vladimir Garin',\n",
       " 'Javier Bardem',\n",
       " 'Preity Zinta',\n",
       " 'Alan Mak',\n",
       " 'Johnny Depp',\n",
       " 'Craig T. Nelson',\n",
       " 'Tae-Hyun Cha',\n",
       " 'Nicole Kidman',\n",
       " 'Jake Gyllenhaal',\n",
       " 'Tom Cruise',\n",
       " 'Björk',\n",
       " 'Richard Farnsworth',\n",
       " 'Junko Iwao',\n",
       " 'Ulrich Thomsen',\n",
       " 'Fernanda Montenegro',\n",
       " 'Eli Marienthal',\n",
       " 'Til Schweiger',\n",
       " 'Timothy Spall',\n",
       " 'Atsuko Tanaka',\n",
       " 'Danny Elfman',\n",
       " 'Bill Murray',\n",
       " 'Damian Chapa',\n",
       " 'John Musker',\n",
       " 'Kirk Wise',\n",
       " 'Danny Aiello',\n",
       " 'Dustin Hoffman',\n",
       " 'Mitsuo Iwata',\n",
       " 'Cary Elwes',\n",
       " 'Gaspard Manesse',\n",
       " 'Mayumi Tanaka',\n",
       " 'Ben Kingsley',\n",
       " 'Roy Scheider',\n",
       " 'Gene Wilder',\n",
       " 'Timothy Bottoms',\n",
       " 'Topol',\n",
       " 'Jean-Louis Trintignant',\n",
       " 'Mia Farrow',\n",
       " 'Elizabeth Taylor',\n",
       " 'Julie Andrews',\n",
       " 'Omar Sharif',\n",
       " 'Marcello Mastroianni',\n",
       " 'Anna Karina',\n",
       " 'John Wayne',\n",
       " 'Burt Lancaster',\n",
       " 'Sterling Hayden',\n",
       " 'Robert Mitchum',\n",
       " 'Simone Signoret',\n",
       " 'Vivien Leigh',\n",
       " 'Dennis Price',\n",
       " 'Celia Johnson',\n",
       " 'Gene Tierney',\n",
       " 'Myrna Loy',\n",
       " 'Marcel Dalio',\n",
       " 'William Powell',\n",
       " 'Lew Ayres',\n",
       " 'Aleksandr Antonov',\n",
       " 'Lily Franky',\n",
       " 'Adam Driver',\n",
       " 'Armie Hammer',\n",
       " 'Bryan Cranston',\n",
       " 'Ferdia Walsh-Peelo',\n",
       " 'Chris Hemsworth',\n",
       " 'Roman Griffin Davis',\n",
       " 'Amy Adams',\n",
       " 'Daisy Ridley',\n",
       " 'Patrick Stewart',\n",
       " 'Muhammet Uzuner',\n",
       " 'Jean Dujardin',\n",
       " 'Tahar Rahim',\n",
       " 'Sam Rockwell',\n",
       " 'Kåre Hedebrant',\n",
       " 'Sharlto Copley',\n",
       " 'Mickey Rourke',\n",
       " 'Ellar Coltrane',\n",
       " 'Anamaria Marinca',\n",
       " 'Chris Pine',\n",
       " 'Colin Farrell',\n",
       " 'David Lee Smith',\n",
       " 'Ken Watanabe',\n",
       " 'Lee Pace',\n",
       " 'Suraj Sharma',\n",
       " 'George Clooney',\n",
       " 'Michel Côté',\n",
       " 'Gérard Jugnot',\n",
       " 'Simon Pegg',\n",
       " 'Birol Ünel',\n",
       " 'Jet Li',\n",
       " 'Rosario Flores',\n",
       " 'Branko Djuric',\n",
       " 'Tensai Okamura',\n",
       " 'Franka Potente',\n",
       " 'Julianne Moore',\n",
       " 'Billy Crudup',\n",
       " 'Naomi Watts',\n",
       " 'Ash Brannon',\n",
       " 'Mark Wahlberg',\n",
       " 'Yoko Honna',\n",
       " 'Rena Owen',\n",
       " 'Christian Slater',\n",
       " 'Juliette Binoche',\n",
       " 'Kôichi Yamadera',\n",
       " 'Martin Landau',\n",
       " 'Jonathan Pryce',\n",
       " 'Peter Billingsley',\n",
       " 'John Belushi',\n",
       " 'David Emge',\n",
       " 'Magali Noël',\n",
       " 'Fernando Rey',\n",
       " 'Ruth Gordon',\n",
       " 'George C. Scott',\n",
       " 'Duane Jones',\n",
       " 'Peter OToole',\n",
       " 'Sidney Poitier',\n",
       " 'Frank Sinatra',\n",
       " 'Gabriele Ferzetti',\n",
       " 'Emmanuelle Riva',\n",
       " 'James Dean',\n",
       " 'Gary Cooper',\n",
       " 'Farley Granger',\n",
       " 'Edmund Gwenn',\n",
       " 'William Keighley',\n",
       " 'Edmund Goulding',\n",
       " 'Ernest B. Schoedsack',\n",
       " 'Wallace Ford',\n",
       " 'Max Schreck',\n",
       " 'Alia Bhatt',\n",
       " 'Riz Ahmed',\n",
       " 'Shahab Hosseini',\n",
       " 'Fionn Whitehead',\n",
       " 'Giuseppe Battiston',\n",
       " 'Taraji P. Henson',\n",
       " 'Ben Whishaw',\n",
       " 'Charlize Theron',\n",
       " 'Casey Affleck',\n",
       " 'Roland Møller',\n",
       " 'Felicity Jones',\n",
       " 'Samuel L. Jackson',\n",
       " 'Saoirse Ronan',\n",
       " 'Hugh Welchman',\n",
       " 'Bill Nighy',\n",
       " 'Bérénice Bejo',\n",
       " 'Toni Servillo',\n",
       " 'Chris Williams',\n",
       " 'Domhnall Gleeson',\n",
       " 'Sridevi',\n",
       " 'Geoffrey Rush',\n",
       " 'Jared Gilman',\n",
       " 'Jay Baruchel',\n",
       " 'Takako Matsu',\n",
       " 'Lee Byung-Hun',\n",
       " 'Won Bin',\n",
       " 'OShea Jackson Jr.',\n",
       " 'Hye-ja Kim',\n",
       " 'Kim Yoon-seok',\n",
       " 'Ian McKellen',\n",
       " 'Christian Friedel',\n",
       " 'Michael Nyqvist',\n",
       " 'Eddie Redmayne',\n",
       " 'Asa Butterfield',\n",
       " 'Glen Hansard',\n",
       " 'Martin Freeman',\n",
       " 'Baki Davrak',\n",
       " 'Keira Knightley',\n",
       " 'Denzel Washington',\n",
       " 'Sam Worthington',\n",
       " 'Jared Leto',\n",
       " 'Gerardo Taracena',\n",
       " 'Valerie Faris',\n",
       " 'Shôgo Furuya',\n",
       " 'Nathan Fillion',\n",
       " 'Andreas Wilson',\n",
       " 'Gena Rowlands',\n",
       " 'Gael García Bernal',\n",
       " 'Oksana Akinshina',\n",
       " 'Michèle Caucheteux',\n",
       " 'Lee Yeong-ae',\n",
       " 'Jim Caviezel',\n",
       " 'Yun-Fat Chow',\n",
       " 'Cecilia Roth',\n",
       " 'Vicky Jenson',\n",
       " 'Michael Douglas',\n",
       " 'Emily Watson',\n",
       " 'Kevin Jarre',\n",
       " 'Tom Guiry',\n",
       " 'David Thewlis',\n",
       " 'Boyd Kirkland',\n",
       " 'Winona Ryder',\n",
       " 'Cuba Gooding Jr.',\n",
       " 'James Caan',\n",
       " 'Kirsten Dunst',\n",
       " 'Matthew Broderick',\n",
       " 'Gene Hackman',\n",
       " 'Bruce Campbell',\n",
       " 'Tom Waits',\n",
       " 'Sean Astin',\n",
       " 'Danny Glover',\n",
       " 'Emilio Estevez',\n",
       " 'Sam Waterston',\n",
       " ...]"
      ]
     },
     "execution_count": 139,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "person_unique"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create a node for each movie\n",
    "for i,v in data.iterrows():\n",
    "    conn.query('CREATE (p:Movie{{name:{0},year:{1},rating:{2}}})'.format(repr(v['Series_Title'].replace(\"'\",\"\")), repr(v['Released_Year']), repr(v['IMDB_Rating'])))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create list of unique genres and create a node for each\n",
    "genres_unique = []\n",
    "for v in data.Genre.to_list():\n",
    "    for w in v.split(','):\n",
    "        if w.strip() not in genres_unique:\n",
    "            genres_unique.append(w.strip())\n",
    "\n",
    "for genre in genres_unique:\n",
    "    conn.query('CREATE (p:Genre{{name:{0}}})'.format(repr(genre)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create a node for each genre\n",
    "for genre in data.Genre.unique():\n",
    "    conn.query('CREATE (p:Genre{{name:{0}}})'.format(repr(genre)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 135,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create relationships between movies and genres\n",
    "for i,v in data.iterrows():\n",
    "    for genre in v['Genre'].split(','):\n",
    "        conn.query(f'''\n",
    "        MATCH (m:Movie), (g:Genre)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and g.name = '{genre.strip()}'\n",
    "        CREATE (m)-[t:IS_TYPE]->(g)\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 140,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create relationships between movies and directors\n",
    "for i, v in data.iterrows():\n",
    "    conn.query(f'''\n",
    "        MATCH (m:Movie), (p:Person)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and p.name = '{v['Director'].replace(\"'\",\"\")}'\n",
    "        CREATE (m)-[t:DIRECTED]->(p)\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 141,
   "metadata": {},
   "outputs": [],
   "source": [
    "# create relationships between movies and actors\n",
    "for i, v in data.iterrows():\n",
    "    conn.query(f'''\n",
    "        MATCH (m:Movie), (p:Person)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and p.name = '{v['Star1'].replace(\"'\",\"\")}'\n",
    "        CREATE (m)-[t:STARED]->(p)\n",
    "    ''')\n",
    "    conn.query(f'''\n",
    "        MATCH (m:Movie), (p:Person)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and p.name = '{v['Star2'].replace(\"'\",\"\")}'\n",
    "        CREATE (m)-[t:STARED]->(p)\n",
    "    ''')\n",
    "    conn.query(f'''\n",
    "        MATCH (m:Movie), (p:Person)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and p.name = '{v['Star3'].replace(\"'\",\"\")}'\n",
    "        CREATE (m)-[t:STARED]->(p)\n",
    "    ''')\n",
    "    conn.query(f'''\n",
    "        MATCH (m:Movie), (p:Person)\n",
    "        WHERE m.name = '{v['Series_Title'].replace(\"'\",\"\")}' and p.name = '{v['Star4'].replace(\"'\",\"\")}'\n",
    "        CREATE (m)-[t:STARED]->(p)\n",
    "    ''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record n=<Node element_id='0' labels=frozenset({'Person'}) properties={}>>]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(\"match(n) RETURN n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>()</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    n\n",
       "0  ()"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame([dict(_) for _ in conn.query('match(n) RETURN n')])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "res = conn.query(\"match(n) RETURN n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Node element_id='0' labels=frozenset({'Person'}) properties={}>]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res[0].values()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.10.6 ('ddi': venv)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "bb14a4ce5323770c1afbc53279b457691485bf634bade016bd800b416d2df426"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
